데이터프레임변합하기

필요한 모듈 참조

In [2]:
import pandas as pd
from pandas import DataFrame

---------------------------------------
## #01. 행단위 병합

샘플 DataFrame 만들기

In [3]:
df_top = pd.DataFrame({'국어':[90,82],'수학':[81,76]},index=['민철','철수'])
df_top

    국어  수학
민철  90  81
철수  82  76

In [4]:
df_middle = pd.DataFrame({'국어':[70,62],'영어':[77,68]},index=['영민','정수'])
df_middle

    국어  영어
영민  70  77
정수  62  68

In [5]:
df_bottom = pd.DataFrame({'영어':[70,88],'과학':[81,76]},index=['민철','태영'])
df_bottom

    영어  과학
민철  70  81
태영  88  76

A에 B를 이어 붙이기

- 단순히 헤로로 병합만 수행한다
- 데이터프레임간에 컬럼이 다르더라도 존재하지 않는 컬럼은 빈값(결측치)로 채워 넣는다

In [7]:
df_a=df_top.append([df_middle,df_bottom],sort=False)
df_a

      국어    수학    영어    과학
민철  90.0  81.0   NaN   NaN
철수  82.0  76.0   NaN   NaN
영민  70.0   NaN  77.0   NaN
정수  62.0   NaN  68.0   NaN
민철   NaN   NaN  70.0  81.0
태영   NaN   NaN  88.0  76.0

A,B,C를 병합하기

append() 함수와 동일한 결과

- 단순히 세로 방향으로 덧붙이는 개념이므로 인덱스가 중복되는 경우도 발생한다
- sort파라미터를 생략하거나 True로 지정한 경우 컬럼 순서가 이름순으로 정렬된다
-(중요)병합되는 DataFrame간에 컬럼이 서로 다르다면 sort=False파라미터 필수 지정

In [8]:
df_b=pd.concat([df_top,df_middle,df_bottom],sort=False)
df_b

      국어    수학    영어    과학
민철  90.0  81.0   NaN   NaN
철수  82.0  76.0   NaN   NaN
영민  70.0   NaN  77.0   NaN
정수  62.0   NaN  68.0   NaN
민철   NaN   NaN  70.0  81.0
태영   NaN   NaN  88.0  76.0

---------------------------------------
## #02. 열단위 병합

한번에 두 개의 객체만 병합 가능함

인덱스가 지정되지 않은 샘플 데이터 프레임

In [9]:
df_left=pd.DataFrame({'고객번호':[1001,1002,1003,1004],'이름':['둘리','도우너','또치','길동']})
df_left

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동

In [10]:
df_right=pd.DataFrame({'고객번호':[1001,1002,1003,1005],'금액':[10000,20000,15000,5000]})
df_right

   고객번호     금액
0  1001  10000
1  1002  20000
2  1003  15000
3  1005   5000

두 데이터프레임의 공통 컬럼을 기준으로 병합하기

양쪽 데이터프레임에 모두 존재하는 데이터만 보여준다

> Database의 inner join과 같은 개념

In [12]:
# 병합시 제외되는 항목들
# - df_left의 고객번호 1004번 데이터는 df_right의 고객번호 컬럼과 겹치지 않는다
# - df_right의 고객번호 1005번 데이터는 df_left의 고객번호 컬럼과 겹치지 않는다
pd.merge(df_left,df_right)

   고객번호   이름     금액
0  1001   둘리  10000
1  1002  도우너  20000
2  1003   또치  15000

왼쪽 데이터프레임을 기준으로 오른쪽 프레임을 병합하기

how='left' 파라미터는 왼쪽 DataFrame의 모든 데이터를 보여준다

> Database의 left Outer join과 같은 개념

In [13]:
# df_right의 고객번호 1005은 df_left에 존재하지 않기 때문에 병합되지 않는다
pd.merge(df_left,df_right,how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1002  도우너  20000.0
2  1003   또치  15000.0
3  1004   길동      NaN

In [14]:
# df_left의 고객번호 1004은 df_right에 존재하지 않기 때문에 병합되지 않는다
pd.merge(df_left,df_right,how='right')

   고객번호   이름     금액
0  1001   둘리  10000
1  1002  도우너  20000
2  1003   또치  15000
3  1005  NaN   5000

양쪽 DataFrame을 모두 병합하기

how='outer' 파라미터를 추가하면 공통 컬럼의 값이 한쪽에만 있어도 데이터를 보여준다

> Database의 Full Outer join과 같은 개념

In [15]:
pd.merge(df_left,df_right,how='outer')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1002  도우너  20000.0
2  1003   또치  15000.0
3  1004   길동      NaN
4  1005  NaN   5000.0

중복되는 데이터가 존재하는 경우의 열단위 병합

모든 경우의 수를 따져서 조합을 만들어낸다

In [16]:
df_first=pd.DataFrame({'아이디':['hello','world','python','hello'],'결재금액':[14000,13000,15000,13000]})
df_first

      아이디   결재금액
0   hello  14000
1   world  13000
2  python  15000
3   hello  13000

In [17]:
df_second=pd.DataFrame({'아이디':['hello','python','python','world'],'적립금':[300,500,100,200]})
df_second

      아이디  적립금
0   hello  300
1  python  500
2  python  100
3   world  200

In [18]:
pd.merge(df_first,df_second)

      아이디   결재금액  적립금
0   hello  14000  300
1   hello  13000  300
2   world  13000  200
3  python  15000  500
4  python  15000  100

공통 컬럼이 두개 이상 존재하는 경우의 병합

두 데이터프레임에서 이름이 같은 열은 모두 키가 된다

In [19]:
df_a=pd.DataFrame({'고객명':['민수','수영'],
                   '데이터':['2000','100000'],
                   '날짜':['2018-01-01','2018-01-01']})
df_a

  고객명     데이터          날짜
0  민수    2000  2018-01-01
1  수영  100000  2018-01-01

In [20]:
df_b=pd.DataFrame({'고객명':['민수','수영'],'데이터':['21세','20세']})
df_b

  고객명  데이터
0  민수  21세
1  수영  20세

In [22]:
# '고객'컬럼과 '데이터'컬럼이 동시에 일치하는 데이터를 찾아 병합한다
# df_a의 '데이터'는 금액을 의미하지만 df_b의 '데이터는'나이를 의미하므로 병합되어서는 안된다
# -> 존재하지 않으므로 결과 없음
pd.merge(df_a,df_b)

Empty DataFrame
Columns: [고객명, 데이터, 날짜]
Index: []

on 파라미터를 사용하여 기준열 지정하기

In [24]:
# 기준 열이 아니면서 이름이 같은 열에는 _x 또는 _y 와 같은 접미사가 붙는다
merge_tmp=pd.merge(df_a,df_b,on=['고객명'])
merge_tmp

  고객명   데이터_x          날짜 데이터_y
0  민수    2000  2018-01-01   21세
1  수영  100000  2018-01-01   20세

In [29]:
merge_result=merge_tmp.rename(columns={"데이터_x":"금액","데이터_y":"나이"})
merge_result

  고객명      금액          날짜   나이
0  민수    2000  2018-01-01  21세
1  수영  100000  2018-01-01  20세

In [30]:
pd.merge(df_a,df_b,how='left')

  고객명     데이터          날짜
0  민수    2000  2018-01-01
1  수영  100000  2018-01-01

공통 컬럼이 존재하지 않는 경우의 병합

lift_on, right_on 파라미터를 사용하여 병합의 기준이 되는 열 이름을 명시해야 한다

In [32]:
국어점수=DataFrame({'이름':['영희','철수'],'국어':[87,91]})
국어점수

   이름  국어
0  영희  87
1  철수  91

In [33]:
영어점수=DataFrame({'성명':['영희','철수'],'영어':[90,82]})
영어점수

   성명  영어
0  영희  90
1  철수  82

In [35]:
# 왼쪽의 이름 컬럼과 오른쪽의 성명 컬럼이 같은 데이터를 병합하라는 의미
국어영어=pd.merge(국어점수,영어점수,left_on=['이름'],right_on=['성명'])
국어영어

   이름  국어  성명  영어
0  영희  87  영희  90
1  철수  91  철수  82

In [36]:
# 중복되는 값을 갖는 '성명' 컬럼은 필요 없으므로 삭제
국어영어.drop('성명',axis=1,inplace=True)
국어영어

   이름  국어  영어
0  영희  87  90
1  철수  91  82

인덱스를 기준으로 하는 병합

left_index=True, right_index=True 파라미터를 선택적으로 사용한다

In [40]:
수학점수=DataFrame({'수학':[90,82]},index=['민철','봉구'])
수학점수

    수학
민철  90
봉구  82

In [41]:
과학점수=DataFrame({'과학':[90,82]},index=['민철','철수'])
과학점수

    과학
민철  90
철수  82

In [42]:
# 왼쪽에서 index를 기준으로 사용하고, 오른쪽에도 인덱스를 기준으로 사용함
# ->양쪽 데이터 프레임의 인덱스가 같은 행끼리 병합됨
수학과학=pd.merge(수학점수,과학점수,left_index=True,right_index=True)
수학과학

    수학  과학
민철  90  90

In [43]:
# 인덱스가 겹치지 않더라도 병합하도록 how 파라미터를 적용
수학과학=pd.merge(수학점수,과학점수,left_index=True,right_index=True,how='outer')
수학과학

      수학    과학
민철  90.0  90.0
봉구  82.0   NaN
철수   NaN  82.0

왼쪽의 인덱스와 오른쪽의 컬럼을 기준으로 병합하기

In [44]:
한국사=DataFrame({'한국사':[87,91]},index=['영희','철수'])
한국사

    한국사
영희   87
철수   91

In [45]:
세계사=DataFrame({'세계사':[90,82],'이름':['영희','철수']})
세계사

   세계사  이름
0   90  영희
1   82  철수

In [46]:
역사점수=pd.merge(한국사,세계사,left_index=True,right_on=['이름'])
역사점수

   한국사  세계사  이름
0   87   90  영희
1   91   82  철수

In [50]:
# 이름 컬럼을 인덱스로 지정하고 삭제하기
name_list=list(역사점수['이름'])
name_dict={}

for i,v in enumerate(name_list):
    name_dict[i]=v

    
역사점수.rename(index=name_dict,inplace=True)
역사점수.drop('이름',axis=1,inplace=True)
역사점수

    한국사  세계사
영희   87   90
철수   91   82